erpedt.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/СХК_МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСклад</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СХК_Этаж</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабПриемка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erpedt.СХК_Расширение/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="47e1733e-b075-4282-944c-d07d96cd86a9">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="96ee5655-e55c-4d9d-9386-a82e47bcd733">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08a6fc5b-ac14-420f-987d-169c39288bf4">
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e82bc85-5efe-473f-a2a6-04b053896ef5">
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f1d0df-8450-40b2-a6bf-26e9a9bc348d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d8985e0-1a5e-4908-ba86-c4b692cd1634">
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49f3e5fd-cf9c-4585-8222-c47ae930e2dd">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="145a504e-53c5-4349-a710-b106ea052174">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fb4b5c4-30c2-4b89-82ff-7057477218df">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00a21d2c-dfa9-40aa-938f-3fe890533f41">
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6a9f8399-4614-4cb5-ba80-210c90c11e54">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ee7ff7a-ec43-4840-800d-22245c14dc90">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b4c013e1-f51f-4900-840f-f755e500fa76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cd1a11-c961-49a0-b7ea-67cc67387e68">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07d94e4d-722d-4939-a3da-ba2a3afba256">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_ПринятТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0d012d0d-0f82-44cb-9d3b-79dd5ae817e2">
    <name>Отгрузил</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="07df2cb8-3a48-4671-b17f-d2bf82e412f8">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83f29f84-a577-47ce-933a-46184309914f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СХК_НомерПалета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="83b872e0-168f-4cbc-b791-68c2edf79de4">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd7cf0b2-0078-4dfa-b137-5418e69d7024">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e2e117e-50d4-46cf-9e08-ea6f475d1cca">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae04c7e3-73f4-4a07-bef6-baf69fcb4dfc">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0185ac19-4e81-475e-842b-4f1cec88f0d3">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="323f8573-378e-4fef-931a-b93c2c113890">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4e6782d-54b8-4614-8549-b94f2af33d1b">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8666ee78-482b-4c09-9baa-791917648dbd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9cf586a-fbd5-4e5f-a0f7-df3ef40e11d2">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc35a8ee-3531-4b7e-8222-611bb0bc88ab">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40dd6af6-2e66-4e56-b31e-687455807ff2">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpedt.СХК_Расширение/src/Documents/ЗаказНаПеремещение/ЗаказНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a0254d97-793a-47e1-8640-7712761e87f0">
  <name>ЗаказНаПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="2e5dd6c3-73c3-40ec-8b0d-c965441580ad">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e7173c73-2661-4531-b527-d9ab16221f1b">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8510f494-1391-4b32-b70c-8b3b9cd19069">
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="10b88158-c80b-41f7-a495-e589cc0686fc">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="7b4da320-9332-4032-9c16-a05fabf9e623">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1cfd08e2-e873-414e-95c5-a40c01997cea">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpedt.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/Forms/СМ_ФормаСборкиПеремещения/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если СтруктураПараметров.ДокументЗаказПеремещения <> "" Тогда
		ЭтотОбъект.ДокументЗаказПеремещения = СтруктураПараметров.ДокументЗаказПеремещения;
		ЗаполнитьФорму(СтруктураПараметров.ДокументЗаказПеремещения,СтруктураПараметров.СтрокаДокументЗаказПеремещения);
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму(ДокЗаказа,СтрокаЗаказа)
	
	ЭтотОбъект.Номенклатура = СтрокаЗаказа.Номенклатура; 
	ЭтотОбъект.СкладОтправитель = ДокЗаказа.СкладОтправитель;
	Вложение = ПроверитьВложение(СтрокаЗаказа.Номенклатура);
	ЭтотОбъект.КоличествоВложений = ?(Вложение>0,Вложение,0);

	Если Вложение >=1 Тогда
		ЭтаФОрма.Элементы.ВыборУпаковки.Видимость = Истина;	
	Иначе
		ЭтотОбъект.Упаковка = СтрокаЗаказа.Номенклатура.ЕдиницаИзмерения;
	КонецЕсли;
	
	Если СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ИспользоватьСерии = Ложь Тогда
		Элементы.ВыбратьСерию.Доступность = Ложь;
		ЭтотОбъект.ПараметрыУказанияСерий = Ложь;
	Иначе 
		//Элементы.КоличествоУпаковокСобрано.Доступность = Ложь;
		Отбор = Новый Структура;
		Отбор.Вставить("Склад",ДокЗаказа.СкладОтправитель);
		Отбор.Вставить("ПолитикаУчетаСерий",Справочники.ПолитикиУчетаСерий.НайтиПоНаименованию("Учет себестоимости по сериям"));
		Строки = СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ПолитикиУчетаСерий.НайтиСтроки(Отбор);
		
		Если Строки.Количество()>=1 Тогда
			ЭтотОбъект.ПараметрыУказанияСерий = Истина; 
			ЭтотОбъект.ИспользоватьСерии = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	
	ЭтотОбъект.СерииНоменклатуры = СтрокаЗаказа.СерииНоменклатуры; 
	Если Не ЭтотОбъект.СерииНоменклатуры.Пустая() Тогда
		ЭтотОбъект.Упаковка = ЭтотОбъект.СерииНоменклатуры.СХК_Упаковка;
	КонецЕсли;
	
	ЭтотОбъект.КоличествоУпаковок = СтрокаЗаказа.КоличествоУпаковок;
	ЭтаФорма.Элементы.ЕдДок.Заголовок = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения; 
	ЭтотОбъект.КоличествоУпаковокСобрано = СтрокаЗаказа.КоличествоУпаковокСобрано;
	
	ДокРО = ПолучитьРасходныйОрдер(ДокЗаказа);
	Если ДокРО = Ложь Тогда
		НовыйДокРО = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
		НовыйДокРО.Дата = ТекущаяДата();  
		НовыйДокРО.ДатаОтгрузки = ТекущаяДата();  
		НовыйДокРО.Ответственный = Пользователи.АвторизованныйПользователь();
		НовыйДокРО.Получатель = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика; 
		НовыйДокРО.Получатель = ДокЗаказа.СкладПолучатель;
		НовыйДокРО.Склад = ДокЗаказа.СкладОтправитель;
		НовыйДокРО.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению;
		НовыйДокРО.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке;
		НовыйДокРО.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
		НовыйДокРО.Записать(РежимЗаписиДокумента.Запись); 
		ДокументРО = НовыйДокРО.Ссылка;
	Иначе
		ДокументРО = ДокРО.Ссылка;
		Если СтрокаЗаказа.КоличествоУпаковокСобрано > 0 Тогда
			Элементы.Добавить.Видимость = Ложь;
			Элементы.Изменить.Видимость = Истина;
			Если СтрокаЗаказа.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
				Элементы.СоздатьСерииНоменклатуры.Доступность = Ложь; 
			КонецЕсли;  
		Иначе 
			Собрано = 0;
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",СтрокаЗаказа.Номенклатура);
			//Отбор.Вставить("Серия",СтрокаЗаказа.СерииНоменклатуры); 
			Строки = ДокументРО.ОтгружаемыеТовары.НайтиСтроки(Отбор);
			Если Строки.Количество()>=1 Тогда
				Для сч=0 по Строки.Количество()-1 Цикл
					Собрано = Собрано + Строки[сч].КоличествоУпаковок;
				КонецЦикла;
				Элементы.ДекорацияОстаток.Заголовок = "Осталось собрать: " +Строка(?(СтрокаЗаказа.КоличествоУпаковок - Собрано>0,СтрокаЗаказа.КоличествоУпаковок - Собрано,0));// - Собрано);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	 

КонецПроцедуры

&НаСервере
Функция ПолучитьРасходныйОрдер(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	               |ГДЕ
	               |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
	               |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
	               |	И ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	               |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = Значение(Перечисление.СтатусыРасходныхОрдеров.КОтгрузке)";
	Запрос.УстановитьПараметр("Распоряжение",Заказ.Ссылка );
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ОткрытьФормуВыбораСерии()
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("Регистратор",ЭтотОбъект.ДокументЗаказПеремещения);
	ПараметрыФормыОстатки.Вставить("Склад",ЭтотОбъект.СкладОтправитель);
	ПараметрыФормыОстатки.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеВыбратьСерию", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_ФормаВыбораСерии", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ОткрытьФорму("ВнешняяОбработка.СХК_МобильныйСклад.Форма.СМ_ФормаВыбораСерии", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ВыборСерии(Команда)
	ОткрытьФормуВыбораСерии();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеВыбратьСерию(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда                  

		ЭтотОбъект.СерииНоменклатуры = Значение.СерииНоменклатуры;  
		ЭтотОбъект.ДоступныйОстаток = Значение.ДоступныйОстаток; 
		ЭтотОбъект.Упаковка = Значение.Упаковка; 
		ед = ЕдиницаИзмеренияНоменклатуры();
		
		Если ЗначениеЗаполнено(Значение.Упаковка) Тогда
			Если Значение.Упаковка <> ед.ЕдиницаИзмерения Тогда
				ЭтотОбъект.ДоступныйОстатокЕД = Строка(Окр(Значение.ДоступныйОстаток/ед.Числитель,2)) + " упак";// + " " + Строка(ед.ЕдиницаИзмерения);
			КонецЕсли;
		КонецЕсли;
		
		ОчиститьКоличествоУпаковокПринято();
		АктивироватьКоличествоУпаковокПринято();
		ЭтаФорма.Элементы.Декорация1.Заголовок = "";
		Если Не ПроверитьСерииДокумент() Тогда
			Ответ = Вопрос("Дублирование серии ЗАПРЕЩЕНО !!!",//"Ордер собран",//"Разместить ордер ?",
			РежимДиалогаВопрос.ОК,
			0, // таймаут в секундах
			КодВозвратаДиалога.ОК, // (необ.) кнопка по умолчанию
			"Вопрос" // (необ.) заголовок
			//"По данному ордеру все собрано !!!"
			);
	
			Если Ответ = КодВозвратаДиалога.ОК Тогда 
				ЭтаФорма.Закрыть();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьСерииДокумент() 
		Док = ЭтотОбъект.ДокументРО.ПолучитьОбъект();
		
		ТабРасп = Док.ТоварыПоРаспоряжениям.Выгрузить();
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ЭтотОбъект.Номенклатура);
		Отбор.Вставить("Серия", ЭтотОбъект.СерииНоменклатуры.Ссылка);
		
		Строки = ТабРасп.НайтиСтроки(Отбор);
		Если Строки.Количество()>=1 Тогда  
			Возврат Ложь;
				Элементы.Добавить.Видимость = Ложь;
				Элементы.Закрыть.Видимость = Истина;
			Иначе
				Возврат Истина;
			//Элементы.Изменить.Видимость = Истина; 
			//Элементы.ДекорацияСобрали.Заголовок = "Собрано: " +Строка(Строки[0].Количество);// - Собрано);
		КонецЕсли;
КонецФункции


 &НаСервере
 Функция ЕдиницаИзмеренияНоменклатуры() 
	 СЗ = Новый Структура;
	 СЗ.Вставить("ЕдиницаИзмерения",ЭтотОбъект.Номенклатура.ЕдиницаИзмерения); 
	 Если ЗначениеЗаполнено(ЭтотОбъект.СерииНоменклатуры.СХК_Упаковка) Тогда
	 	СЗ.Вставить("Числитель",ЭтотОбъект.СерииНоменклатуры.СХК_Упаковка.Числитель); 
	Иначе
	 	СЗ.Вставить("Числитель",ЭтотОбъект.Номенклатура.ЕдиницаИзмерения.Числитель); 
	КонецЕсли;
	
	 Возврат СЗ;
 КонецФункции
 

&НаКлиенте
Процедура ВыборУпаковки(Команда)
	ОткрытьФормуВыбораУпаковки();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораУпаковки()
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборУпаковки", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_ФормаУпаковки", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборУпаковки(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтотОбъект.Упаковка = Значение.Упаковка;  
		ЭтаФорма.Элементы.ДекорацияСобрали.Заголовок = "";
		ЭтаФорма.КоличествоУпаковокСобрано = 0;
		
		Если ЭтотОбъект.ИспользоватьСерии = Ложь Тогда
			ДостОст = ДоступныйОстатокПоСкладу(); 
			ед = ЕдиницаИзмеренияНоменклатуры();
			уп = УпаковкаНоменклатура(Значение.Упаковка);
			ЭтотОбъект.ДоступныйОстаток = ДостОст;

			Если уп.ЕдиницаИзмерения <> ед.ЕдиницаИзмерения Тогда
				ЭтотОбъект.ДоступныйОстатокЕД = Строка(ДостОст/уп.Числитель) + " упак";// + " " + Строка(ед.ЕдиницаИзмерения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДоступныйОстатокПоСкладу()
	Возврат СХК_ТСДСклад.ДоступныйОстатокПоСкладу(ЭтотОбъект.Номенклатура, ЭтотОбъект.ДокументЗаказПеремещения.СкладОтправитель);	
КонецФункции  

&НаСервере
Функция УпаковкаНоменклатура(Упак) 
	
	 СЗ = Новый Структура;
	 СЗ.Вставить("ЕдиницаИзмерения",?(Упак.ЕдиницаИзмерения=Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка(),Упак,Упак.ЕдиницаИзмерения)); 
	 СЗ.Вставить("Числитель",?(Упак.Числитель<>0,Упак.Числитель,1));

	 Возврат СЗ;
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	//Если ЭтаФорма.ПараметрыУказанияСерий = Ложь Тогда
	//	ЭтаФорма.Элементы.КоличествоУпаковокСобрано.РедактированиеТекста = Истина;
	//	АктивироватьКоличествоУпаковокПринято();
	//ИначеЕсли ЭтаФорма.СерииНоменклатуры.Пустая() = Ложь Тогда
	//	АктивироватьКоличествоУпаковокПринято();
	//Иначе 
	//	ЭтаФорма.Элементы.Декорация1.Заголовок = "Выберите серию";
	//	//ОткрытьФормуСозданииСерии();
	//КонецЕсли;
	
	Если ЭтаФорма.КоличествоВложений = 0 И ЭтаФорма.ПараметрыУказанияСерий = Ложь Тогда
		ЭтаФорма.Элементы.КоличествоУпаковокСобрано.РедактированиеТекста = Истина;
		АктивироватьКоличествоУпаковокПринято();
	ИначеЕсли ЭтаФорма.КоличествоВложений = 0 И ЭтаФорма.ПараметрыУказанияСерий = Истина Тогда
		Если ЭтаФорма.СерииНоменклатуры.Пустая() Тогда
			ПодключитьОбработчикОжидания("ОткрытьФормуВыбораСерииПриОткрытии",0.1,Истина) ;
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма.КоличествоВложений > 0 И ЭтаФорма.ПараметрыУказанияСерий = Истина Тогда
		
		Если ЭтаФорма.СерииНоменклатуры.Пустая() Тогда
			ПодключитьОбработчикОжидания("ОткрытьФормуВыбораСерииПриОткрытии",0.1,Истина) ;
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма.КоличествоВложений > 0 И ЭтаФорма.ПараметрыУказанияСерий = Ложь Тогда  
		ПодключитьОбработчикОжидания("ОткрытьФормуВыбораУпаковкиПриОткрытии",0.1,Истина) ;
	//Иначе
	//	ПодключитьОбработчикОжидания("ОткрытьФормуВыбораУпаковкиПриОткрытии",0.1,Истина) ;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСерииПриОткрытии() Экспорт
		ОткрытьФормуВыбораСерии();
КонецПроцедуры   

&НаКлиенте
Процедура ОткрытьФормуВыбораУпаковкиПриОткрытии() Экспорт
	ОткрытьФормуВыбораУпаковки();		
КонецПроцедуры 


 &НаСервере
Процедура ОчиститьКоличествоУпаковокПринято() 
	ЭтотОбъект.КоличествоУпаковокСобрано = 0;
КонецПроцедуры
 
	 
 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Наименование = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции


&НаКлиенте
Процедура АктивироватьКоличествоУпаковокПринято() 
    Элементы.КоличествоУпаковокСобрано.Доступность = Истина; 
	Элементы.КоличествоУпаковокСобрано.ОбновитьТекстРедактирования();
	Элементы.КоличествоУпаковокСобрано.Видимость = Ложь;
	Элементы.КоличествоУпаковокСобрано.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.КоличествоУпаковокСобрано; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 


Функция ПроверитьВложение(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
	               |	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
	               |	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	               |	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	               |	УпаковкиЕдиницыИзмерения.Представление КАК Представление
	               |ИЗ
	               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	               |ГДЕ
	               |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Номенклатура); 
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез.Количество();
КонецФункции

Функция ПолучитьВложение(Номенклатура,Наименование)
	Кратность = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
	               |	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
	               |	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	               |	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	               |	УпаковкиЕдиницыИзмерения.Представление КАК Представление
	               |ИЗ
	               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	               |ГДЕ
	               |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
	               |	И УпаковкиЕдиницыИзмерения.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Владелец",Номенклатура); 
	Запрос.УстановитьПараметр("Наименование",Наименование); 

	Результат = Запрос.Выполнить().Выбрать();
	
КонецФункции




//Ош = 1 превышение количества вопрос
//
&НаСервере
Функция ДобавитьНаСервере(Ош) 
	
	//Ош = Истина;
	//     
	ЧислительУпаковки = ?(ЭтотОбъект.Упаковка.Числитель<>0,ЭтотОбъект.Упаковка.Числитель,1);
	Если ЭтотОбъект.КоличествоУпаковокСобрано = 0 Тогда
		Ош = "Укажите количество";
	ИначеЕсли ЭтотОбъект.ПараметрыУказанияСерий = Истина И ЭтотОбъект.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		Ош = "Заполните серию";
	ИначеЕсли ЭтотОбъект.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		Ош = "Заполните УПАКОВКУ";
	Иначе
		Если ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки > ЭтотОбъект.КоличествоУпаковок И Ош = Ложь Тогда
			Ош = 1;  
		ИначеЕсли ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки > ЭтотОбъект.ДоступныйОстаток Тогда
			Ош = "Нельзя отгружать больше чем на складе";  
			
		Иначе
			
			докЗаказ = ЭтотОбъект.ДокументЗаказПеремещения.ПолучитьОбъект();
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
			Отбор.Вставить("ВариантОбеспечения",Перечисления.ВариантыОбеспечения.КОбеспечению);
			СтрокиПеремещения = докЗаказ.Товары.НайтиСтроки(Отбор);
			Если СтрокиПеремещения.Количество()=1 Тогда
				Если СтрокиПеремещения[0].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки Тогда
					Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
						СтрокиПеремещения[0].СтатусУказанияСерий = 14; 
						СтрокиПеремещения[0].Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
					Иначе
						СтрокиПеремещения[0].СтатусУказанияСерий = 0;
					КонецЕсли; 
					СтрокиПеремещения[0].Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
					
					СтрокиПеремещения[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;	
					СтрокиПеремещения[0].НачалоОтгрузки = ТекущаяДата(); 
					Попытка  
						докЗаказ.Товары.Свернуть("Номенклатура,Упаковка,НачалоОтгрузки,ВариантОбеспечения,СтатусУказанияСерий,Серия","Количество,КоличествоУпаковок");
						докЗаказ.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Ош = "При проведении возникла ошибка";
						Возврат  Ош;
					КонецПопытки;						
				ИначеЕсли СтрокиПеремещения[0].КоличествоУпаковок > ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки Тогда
					СтрокиПеремещения[0].КоличествоУпаковок = СтрокиПеремещения[0].КоличествоУпаковок - ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки;	
					СтрокиПеремещения[0].Количество = СтрокиПеремещения[0].Количество - ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки;	
					
					Т = докЗаказ.Товары.Добавить();
					Т.Номенклатура = ЭтотОбъект.Номенклатура;
					Т.Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
					Т.НачалоОтгрузки = ТекущаяДата();
					Т.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
					Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
						Т.СтатусУказанияСерий = 14; 
						Т.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
					Иначе
						Т.СтатусУказанияСерий = 0;
					КонецЕсли; 
					Т.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки;
					Т.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки;
					
					Попытка 
						докЗаказ.Товары.Свернуть("Номенклатура,Упаковка,НачалоОтгрузки,ВариантОбеспечения,СтатусУказанияСерий,Серия","Количество,КоличествоУпаковок");
						докЗаказ.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Ош = "При проведении возникла ошибка";
						Возврат  Ош;
					КонецПопытки;						
				ИначеЕсли СтрокиПеремещения[0].КоличествоУпаковок < ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки Тогда 
					докЗаказ.Товары.Удалить(СтрокиПеремещения[0]);
					//СтрокиПеремещения[0].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;	
					//СтрокиПеремещения[0].Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;	
					
					Т = докЗаказ.Товары.Добавить();
					Т.Номенклатура = ЭтотОбъект.Номенклатура;
					Т.Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
					Т.НачалоОтгрузки = ТекущаяДата();
					Т.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
					Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
						Т.СтатусУказанияСерий = 14; 
						Т.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
					Иначе
						Т.СтатусУказанияСерий = 0;
					КонецЕсли; 
					Т.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки;
					Т.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки;
					
					Попытка
						докЗаказ.Товары.Свернуть("Номенклатура,Упаковка,НачалоОтгрузки,ВариантОбеспечения,СтатусУказанияСерий,Серия","Количество,КоличествоУпаковок");
						докЗаказ.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Ош = "При проведении возникла ошибка";
						Возврат  Ош;
					КонецПопытки;						
					
				Иначе
					Ош = "При проведении возникла ошибка";
					Возврат  Ош;
				КонецЕсли;
				
			Иначе
				Ош = "При проведении возникла ошибка";
				Возврат  Ош;
			КонецЕсли;
			
			Док = ЭтотОбъект.ДокументРО.ПолучитьОбъект();	
			///////////////////////
			ТРасп = Док.ТоварыПоРаспоряжениям.Добавить();
			ТРасп.Номенклатура = ЭтотОбъект.Номенклатура; 
			ТРасп.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки;
			Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
				ТРасп.СтатусУказанияСерий = 14; 
				ТРасп.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
			Иначе
				ТРасп.СтатусУказанияСерий = 0;
			КонецЕсли;      
			ТРасп.Распоряжение = ЭтотОбъект.ДокументЗаказПеремещения;
			/////////////////////////
			ОтгТов = Док.ОтгружаемыеТовары.Добавить();
			ОтгТов.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить; 
			ОтгТов.Номенклатура = ЭтотОбъект.Номенклатура; 
			Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
				ОтгТов.СтатусУказанияСерий = 14; 
				ОтгТов.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
			Иначе
				ОтгТов.СтатусУказанияСерий = 0;
			КонецЕсли;      
			ОтгТов.Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
			ОтгТов.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки;
			ОтгТов.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЧислительУпаковки;
			//////////////////////////
			Попытка 
				Док.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке;
				Док.Записать(РежимЗаписиДокумента.Проведение);
				Ош = Ложь;
			Исключение 
				Док.Записать(РежимЗаписиДокумента.Запись);
				Ош = "При проведении возникла ошибка"
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;		
	
	Возврат  Ош;
	
КонецФункции


&НаКлиенте
Процедура Добавить(Команда)
	Ош = ДобавитьНаСервере(Ложь);
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Если Ош = 1 Тогда
			ВывестиВопросКоличествоПревышает();
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
			ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте 
Процедура ВывестиВопросКоличествоПревышает()
	
	//@skip-check undefined-function
	Ответ = Вопрос("Количество превышает по документу, ПЕРЕМЕСТИТЬ?",//"Ордер собран",//"Разместить ордер ?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Вопрос" // (необ.) заголовок
	//"По данному ордеру все собрано !!!"
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
 		Ош = ДобавитьНаСервере(Истина);
		Если Ош = Ложь Тогда
			ЭтаФорма.Закрыть();
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
			ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
		КонецЕсли;
	Иначе
		АктивироватьКоличествоУпаковокПринято()	;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт 
					
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьСтрокуДокумента(Команда)
	Ош = ИзменитьНаСервере();
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры 


&НаСервере
Функция ИзменитьНаСервере() 
	
	Ош = Истина;
	
	Если ЭтотОбъект.КоличествоУпаковокСобрано = 0 Тогда
		Ош = "Укажите количество";
	ИначеЕсли ЭтотОбъект.ПараметрыУказанияСерий = Истина И ЭтотОбъект.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		Ош = "Заполните серию";
	Иначе
		
		
		Док = ЭтотОбъект.ДокументРО.ПолучитьОбъект();
		
		ТабРасп = Док.ТоварыПоРаспоряжениям.Выгрузить();
		ТабОтгр = Док.ОтгружаемыеТовары.Выгрузить();
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ЭтотОбъект.Номенклатура);
		Отбор.Вставить("Серия", ЭтотОбъект.СерииНоменклатуры.Ссылка);
		
		Строки = ТабРасп.НайтиСтроки(Отбор);
		Если Строки.Количество()>=1 Тогда  
			ТабРасп.Удалить(Строки[0]);
			//Строки[0].Количество = ЭтотОбъект.КоличествоУпаковокСобрано;
			//Строки[0].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано;
		КонецЕсли;
		Строки = ТабОтгр.НайтиСтроки(Отбор);
		Если Строки.Количество()>=1 Тогда  
			ТабОтгр.Удалить(Строки[0]);
			//Строки[0].Количество = ЭтотОбъект.КоличествоУпаковокСобрано;
			//Строки[0].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано;
		КонецЕсли;
		
		Док.ТоварыПоРаспоряжениям.Очистить();
		Док.ТоварыПоРаспоряжениям.Загрузить(ТабРасп);
		Док.ОтгружаемыеТовары.Очистить();
		Док.ОтгружаемыеТовары.Загрузить(ТабОтгр);
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Ош = Ложь;
		Исключение
			Ош = "При проведении возникла ошибка"
		КонецПопытки;
/////////////
			Док = ЭтотОбъект.ДокументРО.ПолучитьОбъект();	
			///////////////////////
			ТРасп = Док.ТоварыПоРаспоряжениям.Добавить();
			ТРасп.Номенклатура = ЭтотОбъект.Номенклатура; 
			ТРасп.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
			Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
				ТРасп.СтатусУказанияСерий = 14; 
				ТРасп.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
			Иначе
				ТРасп.СтатусУказанияСерий = 0;
			КонецЕсли;      
			ТРасп.Распоряжение = ЭтотОбъект.ДокументЗаказПеремещения;
			/////////////////////////
			ОтгТов = Док.ОтгружаемыеТовары.Добавить();
			ОтгТов.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить; 
			ОтгТов.Номенклатура = ЭтотОбъект.Номенклатура; 
			Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
				ОтгТов.СтатусУказанияСерий = 14; 
				ОтгТов.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
			Иначе
				ОтгТов.СтатусУказанияСерий = 0;
			КонецЕсли;      
			ОтгТов.Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
			ОтгТов.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
			ОтгТов.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
			//////////////////////////
			Попытка 
				Док.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке;
				Док.Записать(РежимЗаписиДокумента.Проведение);
				Ош = Ложь;
			Исключение 
				Док.Записать(РежимЗаписиДокумента.Запись);
				Ош = "При проведении возникла ошибка"
			КонецПопытки;
///////////// 
			Собрано = 0;
			докЗаказ = ЭтотОбъект.ДокументЗаказПеремещения.ПолучитьОбъект();
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
			Отбор.Вставить("ВариантОбеспечения",Перечисления.ВариантыОбеспечения.Отгрузить); 
 			Отбор.Вставить("Серия",ЭтотОбъект.СерииНоменклатуры);
			СтрокиПеремещения = докЗаказ.Товары.НайтиСтроки(Отбор);
            Собрано = СтрокиПеремещения[0].КоличествоУпаковок;		
			
			ОтборИ = Новый Структура;
			ОтборИ.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
			ОтборИ.Вставить("ВариантОбеспечения",Перечисления.ВариантыОбеспечения.КОбеспечению); 
			СтрокиИ = докЗаказ.Товары.НайтиСтроки(ОтборИ);
			
			Если ЭтаФорма.КоличествоУпаковокСобрано = 0 Тогда
				Если СтрокиИ.Количество() = 0 Тогда
					СтрокиПеремещения[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению; 
					СтрокиПеремещения[0].Серия = "";
				Иначе					
					докЗаказ.Товары.Удалить(СтрокиПеремещения[0]);	
				конецЕсли;	
			Иначе  
				СтрокиПеремещения[0].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;;	
				СтрокиПеремещения[0].Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;;
				Если СтрокиИ.Количество() = 1 Тогда 
					СтрокиИ[0].КоличествоУпаковок = (СтрокиИ[0].КоличествоУпаковок + Собрано) -ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;;	
					СтрокиИ[0].Количество = (СтрокиИ[0].Количество + Собрано) - ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;;
				конецЕсли;	
				
			КонецЕсли;
					Попытка
						докЗаказ.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Ош = "При проведении возникла ошибка";
						Возврат  Ош;
					КонецПопытки;						

			
	КонецЕсли;		

	Возврат  Ош;
	
КонецФункции

&НаСервере
Функция ПроверитьУпаковку()
	Ош = Истина;
	ЭтаФорма.Элементы.Декорация1.Заголовок = "";
	Если ЭтаФорма.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда 
		ЭтаФорма.Элементы.Декорация1.Заголовок = "Заполните упаковку";
		КоличествоУпаковокСобрано = 0;
		Ош = Ложь;
	КонецЕсли;     
	Возврат Ош;
КонецФункции

	
&НаКлиенте
Процедура Плюс(Команда)  
	Если ПроверитьУпаковку() Тогда
		КоличествоУпаковокСобрано = КоличествоУпаковокСобрано + 1; 
		КоличествоУпаковокСобраноПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Минус(Команда)
	Если ПроверитьУпаковку() Тогда
		КоличествоУпаковокСобрано = КоличествоУпаковокСобрано - 1; 
		КоличествоУпаковокСобраноПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КоличествоУпаковокСобраноПриИзмененииНаСервере()
	Элементы.ДекорацияСобрали.Заголовок = "Собрано: " +Строка(ЭтаФорма.КоличествоУпаковокСобрано *?(ЭтаФорма.Упаковка.Числитель<>0, ЭтаФорма.Упаковка.Числитель,1));// - Собрано);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУпаковокСобраноПриИзменении(Элемент) 
	Если ПроверитьУпаковку() Тогда
		КоличествоУпаковокСобраноПриИзмененииНаСервере(); 
	КонецЕсли;
КонецПроцедуры
